<!-- 文本类型的可选项组件 -->
<template>
    <div>
        <div class="content">
            <i class="el-icon-edit edit_but"></i>
            <h1>林河</h1>
            <p>
                紫川名将，紫川秀原名林河，出身不详（根据魔神皇卡特与其臣子的对话中可以判断，紫川秀与光明帝国林氏的关系非常的密切，现已证实的确是林家后裔。），但怀疑是人类第一高手左加明王的闭门弟子，与西南林氏家族有千丝万缕的联系，幼时身为孤儿被家族总长（君主）紫川远星收养，赐姓紫川，也因此与家族继承人的紫川宁结下青梅竹马之缘。后来，因遭魔族陷害沦落远东，白手起家建立新远东号光明王，最后重建光明帝国，并向流风霜求婚成功。
            </p>
            <h2>主要剧情</h2>
            <ol>
                <li>
                    11岁率领远东军校800学员大破当时流风家族族长流风西山于帝都城下，拯救紫川家族，但随后被当时的家族总统领杨明华解除兵权，发配到远东前线作战，效力于远东统领哥应星大人麾下，也因此结识后来名闻天下的未来家族检察长“修罗王”帝林与军务处统领“紫川之虎”斯特林，三人结为兄弟，史称“紫川三杰”。被发配远东后，帝国历778年第三次恒川会战，紫川秀阵前刺杀魔族第一猛将葛沙，以3万骑兵大破8万魔族精兵，擒魔族公主卡丹，因功晋升副统领回帝都述职，随后参与了平定杨明华叛乱的活动。但是因在帝都流血之夜替参与叛变的中央军军官求情，被当时总长紫川参星调为预备役军官，但也因此创立了闻名后世的秀字营，这支部队后来随紫川秀东征西讨，被誉为大陆最强的军队。
                </li>
                <li>
                    帝国历779年3月28日，原远东军统领哥应星被远东军副统领雷洪埋伏偷袭，重伤突围后死于瓦伦要塞。家族为报此深仇，派遣远东军副统领林冰等将领率军清剿雷洪叛军，但远东各种族因种族积怨掀起远东全境的叛乱，林冰受命回军平定叛乱，在赤水摊与远东种族叛军大战，关键时刻雷洪率叛军赶来增援，大败远东军，林冰退回瓦伦要塞。紫川家调中央军，边防军，黑旗军奔赴远东平叛。月亮湾一役，雷洪引魔族入远东，紫川军几乎全军覆没，黑旗军统领方劲战死，随后数天边防军等紫川家部队大败，损失惨重，惟中央军与边防军换防逃过一劫。为挽救数百万远东家族子民，斯特林与紫川秀孤军深入作为诱饵牵制魔族大军行动，被围于帕依城。后斯特林及中央军随被天价赎回，但紫川秀毅然留下，佯装投降魔族，在宴会上斩杀叛徒雷洪，为哥应星报仇。但魔族设计诬陷紫川秀叛降，紫川秀被迫留在远东。
                </li>
                <li>
                    秀川历尽千辛万苦，领导被紫川家和魔族欺凌的远东民众建立起自己的政权，被远东人民称作光明王，紫川秀为了远东政权的生存，通缉之身返回紫川，在途中偶遇化名林雨的流风霜被追杀，出手相救。紫川秀曾与未来的家族总长紫川宁相恋，却在与魔族的战争中遭到恋人的背叛。后击败并收编魔族远东总督鲁帝所部军团，远东于是独立。但不久曾力挺紫川秀的远东圣庙长老布丹策动军队哗变，剥夺了紫川秀对远东军的指挥权。尽管后来紫川秀重新夺回远东领导权，但远东军因干预魔族王权战争，随即遭到魔族的疯狂报复。后以家族支援远东为条件，转任黑旗军统领，镇守西南，在林家河丘再次相遇流风霜，结为知己。后铲除西南马氏家族势力，为紫川家抵御流风家入侵，力挫人类第一名将流风霜。
                </li>
                <li>
                    在魔族大举侵略人类世界期间，转任远东统领，袭扰远东魔族，并长途驰援紫川家帝都，与紫川家、流风家合力讨伐魔神皇卡特，在达克大败魔族，并率军杀入魔族王国，加冕魔族皇帝，兼紫川家族远东兼极东军区统领。
                    魔族神典上形容他是：“崛起于草莽去跻身至尊，实乃天去所至。英明过人，宽仁爱民，疆域之阔，功业之盛，史无前例。”
                    后来紫川家族出现重大变故——三杰之乱（实际上只有两杰，斯特林已死），由于家族总统领罗明海刺杀家族监察长帝林失败，帝林率亲卫哗变，杀死总长紫川参星，诱杀家族重臣斯特林等，收编远征军，占据帝都。家族继承人紫川宁冒死逃脱至远东，紫川秀痛心疾首，以致一夜白发，考虑再三后，紫川秀起勤王之兵讨伐帝林，双方会战沙岗城，最后竟已二杰比武定胜负，帝林败北，叛党瓦解，紫川秀拥立紫川宁返还帝都。但就在紫川宁继承总长之位时，却又立即禅位于秀川。紫川秀随集魔族皇帝、远东光明王、紫川家族总长于一身，辖百万虎贲，联合流风霜兵锋直指河丘林氏，解除林氏军队，驻军于内。一统大陆的紫川帝国已冉冉初现。
                </li>
            </ol>
        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {
        }
    }
}

</script>

<style lang='less' scoped>
.edit_but {
    display: block;
    position: absolute;
    top: 0px;
    right: 5px;
    cursor: pointer;

    &:hover {
        color: #91d5ff;
    }

}
</style>
